<H1> Assignment - 13 SQL 2 </H1>

<H5> Importing Libraries </H5>

In [10]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series
import sqlite3 as db
import sqlalchemy
from sqlalchemy import create_engine
from sqlalchemy.ext.declarative import declarative_base
from sqlalchemy import Column, Integer, String
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

<H4> Reading from the csv file and renaming the columns </H4>

In [2]:
colnames=['age','workclass','fnlwgt','education','educationNum','marital-status','occupation','relationship','race','sex','capital-gain','capital-loss','hours-per-week','native-country','income']
sqladb = pd.read_csv('https://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data', names=colnames, header=None)

<H3> Creating first Sample Dataframe to Create SQL Alchemy Engine and create database table </H3>

In [3]:
data1 = sqladb[:4]

In [4]:
data1.shape

(4, 15)

In [5]:
data1.head()

,age,workclass,fnlwgt,education,educationNum,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K

<H3> Creating Second Sample Dataframe with 2 records to UPDATE the already created database table </H3>

In [6]:
data2 = sqladb.tail(2)

In [7]:
data2.shape

(2, 15)

In [8]:
data2.head()

,age,workclass,fnlwgt,education,educationNum,marital-status,occupation,relationship,race,sex,capital-gain,capital-loss,hours-per-week,native-country,income
32559,22,Private,201490,HS-grad,9,Never-married,Adm-clerical,Own-child,White,Male,0,0,20,United-States,<=50K
32560,52,Self-emp-inc,287927,HS-grad,9,Married-civ-spouse,Exec-managerial,Wife,White,Female,15024,0,40,United-States,>50K

<H3> Question 1</H3>
<H4> Create an sqlalchemy engine using a sample from the data set</H4>

In [11]:
engine = create_engine('sqlite:///:memory:')
connection = engine.connect()
data1.to_sql('adult', engine)

In [12]:
engine.execute("SELECT * FROM adult").fetchall()

[(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'),
 (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K')]

In [13]:
engine.execute("SELECT count(*) FROM adult").fetchall()

[(4,)]

<H3>2. Write two basic update queries </H3>

In [14]:
data2.to_sql('adult', engine,if_exists='append')

In [15]:
engine.execute("SELECT count(*) FROM adult").fetchall()

[(6,)]

In [16]:
engine.execute("SELECT * FROM adult").fetchall()

[(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K'),
 (1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K'),
 (2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (32559, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K'),
 (32560, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K')]

In [38]:
engine.execute("SELECT * FROM adult WHERE fnlwgt ==83311 ;").fetchall()

[(1, 50, ' Self-emp-not-inc', 83311, ' Bachelors', 13, ' Married-civ-spouse', ' Exec-managerial', ' Husband', ' White', ' Male', 0, 0, 13, ' United-States', ' <=50K')]

In [32]:
from sqlalchemy import *
from sqlalchemy.sql import table, column, select, update, insert

# define meta information
metadata = MetaData(bind=engine)
mytable = Table('adult', metadata, autoload=True)

In [39]:
u = update(mytable)
u = u.values({"age": 45})
u = u.where(mytable.c.fnlwgt ==83311)
engine.execute(u)

In [41]:
engine.execute("SELECT * FROM adult WHERE age ==53 ;").fetchall()

[(3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K')]

In [42]:
u = update(mytable)
u = u.values({"hours-per-week": 30})
u = u.where(mytable.c.age ==53)
engine.execute(u)

In [43]:
engine.execute("SELECT * FROM adult WHERE age ==53 ;").fetchall()

[(3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 30, ' United-States', ' <=50K')]

<H3> 3. Write two delete queries </H3>

In [17]:
engine.execute("SELECT * FROM adult WHERE age ==39 ;").fetchall()

[(0, 39, ' State-gov', 77516, ' Bachelors', 13, ' Never-married', ' Adm-clerical', ' Not-in-family', ' White', ' Male', 2174, 0, 40, ' United-States', ' <=50K')]

In [18]:
engine.execute("DELETE FROM adult WHERE age ==39 ;")

In [19]:
engine.execute("SELECT * FROM adult WHERE age ==39 ;").fetchall()

[]

In [20]:
engine.execute("SELECT * FROM adult WHERE fnlwgt ==201490 ;").fetchall()

[(32559, 22, ' Private', 201490, ' HS-grad', 9, ' Never-married', ' Adm-clerical', ' Own-child', ' White', ' Male', 0, 0, 20, ' United-States', ' <=50K')]

In [21]:
engine.execute("DELETE FROM adult WHERE fnlwgt ==201490 ;")

In [22]:
engine.execute("SELECT * FROM adult WHERE fnlwgt ==201490 ;").fetchall()

[]

<H3>4. Write two filter queries </H3>

In [25]:
engine.execute("SELECT * FROM adult WHERE workclass LIKE '%Private' ;").fetchall()

[(2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K')]

In [26]:
engine.execute("SELECT * FROM adult WHERE [hours-per-week] >30 ;").fetchall()

[(2, 38, ' Private', 215646, ' HS-grad', 9, ' Divorced', ' Handlers-cleaners', ' Not-in-family', ' White', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (3, 53, ' Private', 234721, ' 11th', 7, ' Married-civ-spouse', ' Handlers-cleaners', ' Husband', ' Black', ' Male', 0, 0, 40, ' United-States', ' <=50K'),
 (32560, 52, ' Self-emp-inc', 287927, ' HS-grad', 9, ' Married-civ-spouse', ' Exec-managerial', ' Wife', ' White', ' Female', 15024, 0, 40, ' United-States', ' >50K')]

<H3> 5. Write two function queries </H3>

In [27]:
engine.execute("SELECT (AVG([hours-per-week])) FROM adult").fetchall()

[(33.25,)]

In [28]:
engine.execute("SELECT AVG(age),MAX(age),MIN(age) FROM adult").fetchall()

[(48.25, 53, 38)]